of60/tutorials/cavity_heatedWalls_Newtonian/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

  (0 0 -.01)
  (1 0 -.01)
  (1 1 -.01)
  (0 1 -.01)

  (0 0 .01)
  (1 0 .01)
  (1 1 .01)
  (0 1 .01)
 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (63 63 1) simpleGrading (1 1 1) //0
);

edges
(
);

boundary
(
   
    movingLid
    {
        type wall;
        faces
        (
            (3 2 6 7)            
        );
    }
    
    bottomWall
    {
    	type wall;
	faces
	(
            (0 1 5 4)
	);
    }
    
    westWall
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }    

    eastWall
    {
        type wall;
        faces
        (
            (5 6 2 1)            
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3) 
            (4 5 6 7)           
        );
    }
  
);

mergePatchPairs
(
);

// ************************************************************************* //
