of60/tutorials/cavity_heatedWalls_Newtonian/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");
      
setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;

fields
(
   U
   tau
   theta
);

sets
(
    lineVert_x0.5
    {
        type        lineFace;
        axis        y;

        start       ( 0.5 -0.1 0.);
        end         ( 0.5 1.1 0. );         
    }

    lineHorz_y0.75
    {
        type        lineFace;
        axis        x;

        start       ( -0.1 0.75 0.);
        end         ( 1.1 0.75 0. );         
    }
     
 
);

